In [1]:
import pandas as pd

In [3]:
dict1={
    "name":["ineuron","Sudh","krish","kumar"],
     "number":[3,4,6,9],
    "test":["xyz","abc","dyu","ert"],
    "string":["dffsd","wqew","tetst","nennwe"]
}

In [5]:
#convert dictionary to dataframe
df1=pd.DataFrame(dict1)

In [7]:
df1

      name  number test  string
0  ineuron       3  xyz   dffsd
1     Sudh       4  abc    wqew
2    krish       6  dyu   tetst
3    kumar       9  ert  nennwe

In [57]:
dict2={
    "name":["ineuron1","Sudh1","krish","kumar"],
     "number":[31,41,6,19],
    "test":["xyz1","abc1","dy1u","er1t"],
    "string":["dffs1d","wq1ew","tet1st","ne1nnwe"]
}

In [16]:
df2=pd.DataFrame(dict2)

In [20]:
df2

       name  number  test  string1
0  ineuron1      31  xyz1   dffs1d
1     Sudh1      41  abc1    wq1ew
2     krish       6  dy1u   tet1st
3     kumar      19  er1t  ne1nnwe

In [17]:
#concatenation operation vertical
pd.concat([df1,df2])

       name  number  test  string  string1
0   ineuron       3   xyz   dffsd      NaN
1      Sudh       4   abc    wqew      NaN
2     krish       6   dyu   tetst      NaN
3     kumar       9   ert  nennwe      NaN
0  ineuron1      31  xyz1     NaN   dffs1d
1     Sudh1      41  abc1     NaN    wq1ew
2     krish       6  dy1u     NaN   tet1st
3     kumar      19  er1t     NaN  ne1nnwe

In [21]:
#Concat by column wise
pd.concat([df1,df2],axis=1)

      name  number test  string      name  number  test  string1
0  ineuron       3  xyz   dffsd  ineuron1      31  xyz1   dffs1d
1     Sudh       4  abc    wqew     Sudh1      41  abc1    wq1ew
2    krish       6  dyu   tetst     krish       6  dy1u   tet1st
3    kumar       9  ert  nennwe     kumar      19  er1t  ne1nnwe

In [22]:
#it consider distinct column header name

In [23]:
#store this data in other data frame
df3=pd.concat([df1,df2])

In [25]:
df4=pd.concat([df1,df2],axis=1)

In [27]:
df4.head(4)

      name  number test  string      name  number  test  string1
0  ineuron       3  xyz   dffsd  ineuron1      31  xyz1   dffs1d
1     Sudh       4  abc    wqew     Sudh1      41  abc1    wq1ew
2    krish       6  dyu   tetst     krish       6  dy1u   tet1st
3    kumar       9  ert  nennwe     kumar      19  er1t  ne1nnwe

In [29]:
df4.iloc[1:3]

    name  number test string   name  number  test string1
1   Sudh       4  abc   wqew  Sudh1      41  abc1   wq1ew
2  krish       6  dyu  tetst  krish       6  dy1u  tet1st

In [30]:
df4.iloc[1:3,1:3]

   number test
1       4  abc
2       6  dyu

In [34]:
df4.iloc[1:5,1:4:2]

   number  string
1       4    wqew
2       6   tetst
3       9  nennwe

In [36]:
#row no 1 and row 3
df4.iloc[[1,3]]

    name  number test  string   name  number  test  string1
1   Sudh       4  abc    wqew  Sudh1      41  abc1    wq1ew
3  kumar       9  ert  nennwe  kumar      19  er1t  ne1nnwe

In [40]:
#Row 1 and 3 with column 5 and after all 
df4.iloc[[1,3],5:]

   number  test  string1
1      41  abc1    wq1ew
3      19  er1t  ne1nnwe

In [42]:
#or do like this 
df4.columns

Index(['name', 'number', 'test', 'string', 'name', 'number', 'test',
       'string1'],
      dtype='object')

In [43]:
df5=df4.iloc[[1,3]]

In [45]:
df5[["number","test"]]

   number  number test  test
1       4      41  abc  abc1
3       9      19  ert  er1t

In [58]:
df1=pd.DataFrame(dict1)

In [59]:
df2=pd.DataFrame(dict2)

In [48]:
pd.merge(df1,df2)

Empty DataFrame
Columns: [name, number, test, string, string1]
Index: []

In [60]:
#merge based on column Name 
pd.merge(df1,df2,on="name")

    name  number_x test_x string_x  number_y test_y string_y
0  krish         6    dyu    tetst         6   dy1u   tet1st
1  kumar         9    ert   nennwe        19   er1t  ne1nnwe

In [51]:
#it will merge content based on column name if is same
#Ven diagram is example

In [61]:
pd.merge(df1,df2,on='test')

Empty DataFrame
Columns: [name_x, number_x, test, string_x, name_y, number_y, string_y]
Index: []

In [62]:
pd.merge(df1,df2,on='string',how ='left')

    name_x  number_x test_x  string name_y  number_y test_y
0  ineuron         3    xyz   dffsd    NaN       NaN    NaN
1     Sudh         4    abc    wqew    NaN       NaN    NaN
2    krish         6    dyu   tetst    NaN       NaN    NaN
3    kumar         9    ert  nennwe    NaN       NaN    NaN

In [63]:
pd.merge(df1,df2,on='string',how ='right')

  name_x  number_x test_x   string    name_y  number_y test_y
0    NaN       NaN    NaN   dffs1d  ineuron1        31   xyz1
1    NaN       NaN    NaN    wq1ew     Sudh1        41   abc1
2    NaN       NaN    NaN   tet1st     krish         6   dy1u
3    NaN       NaN    NaN  ne1nnwe     kumar        19   er1t

In [64]:
pd.merge(df1,df2,on='ineuron',how ='left')

KeyError: 'ineuron'

In [70]:
df1

      name  number test  string
0  ineuron       3  xyz   dffsd
1     Sudh       4  abc    wqew
2    krish       6  dyu   tetst
3    kumar       9  ert  nennwe

In [71]:
df2

       name  number  test   string
0  ineuron1      31  xyz1   dffs1d
1     Sudh1      41  abc1    wq1ew
2     krish       6  dy1u   tet1st
3     kumar      19  er1t  ne1nnwe

In [72]:
#merge if column not matching 
pd.merge(df1,df2,left_on='name',right_on='test',how ='left')

    name_x  number_x test_x string_x name_y  number_y test_y string_y
0  ineuron         3    xyz    dffsd    NaN       NaN    NaN      NaN
1     Sudh         4    abc     wqew    NaN       NaN    NaN      NaN
2    krish         6    dyu    tetst    NaN       NaN    NaN      NaN
3    kumar         9    ert   nennwe    NaN       NaN    NaN      NaN

In [73]:
#outer join
pd.merge(df1,df2,left_on='name',right_on='test',how ='outer')

    name_x  number_x test_x string_x    name_y  number_y test_y string_y
0  ineuron       3.0    xyz    dffsd       NaN       NaN    NaN      NaN
1     Sudh       4.0    abc     wqew       NaN       NaN    NaN      NaN
2    krish       6.0    dyu    tetst       NaN       NaN    NaN      NaN
3    kumar       9.0    ert   nennwe       NaN       NaN    NaN      NaN
4      NaN       NaN    NaN      NaN  ineuron1      31.0   xyz1   dffs1d
5      NaN       NaN    NaN      NaN     Sudh1      41.0   abc1    wq1ew
6      NaN       NaN    NaN      NaN     krish       6.0   dy1u   tet1st
7      NaN       NaN    NaN      NaN     kumar      19.0   er1t  ne1nnwe

In [76]:
#merge if name and number match two columns matching
pd.merge(df1,df2,how='left',on=['name','number'])

      name  number test_x string_x test_y string_y
0  ineuron       3    xyz    dffsd    NaN      NaN
1     Sudh       4    abc     wqew    NaN      NaN
2    krish       6    dyu    tetst   dy1u   tet1st
3    kumar       9    ert   nennwe    NaN      NaN

In [77]:
#join in pandas

In [78]:
df1

      name  number test  string
0  ineuron       3  xyz   dffsd
1     Sudh       4  abc    wqew
2    krish       6  dyu   tetst
3    kumar       9  ert  nennwe

In [79]:
df2

       name  number  test   string
0  ineuron1      31  xyz1   dffs1d
1     Sudh1      41  abc1    wq1ew
2     krish       6  dy1u   tet1st
3     kumar      19  er1t  ne1nnwe

In [80]:
df1.join(df2)

ValueError: columns overlap but no suffix specified: Index(['name', 'number', 'test', 'string'], dtype='object')

In [81]:
df1.join(df2)

ValueError: You are trying to merge on object and int64 columns. If you wish to proceed you should use pd.concat

In [82]:
dict3={
    "name1":["ineuron1","Sudh1","krish","kumar"],
     "number1":[31,41,6,19],
    "test1":["xyz1","abc1","dy1u","er1t"],
    "string1":["dffs1d","wq1ew","tet1st","ne1nnwe"]
}

In [83]:
df3=pd.DataFrame(dict3)

In [84]:
df1.join(df3)

      name  number test  string     name1  number1 test1  string1
0  ineuron       3  xyz   dffsd  ineuron1       31  xyz1   dffs1d
1     Sudh       4  abc    wqew     Sudh1       41  abc1    wq1ew
2    krish       6  dyu   tetst     krish        6  dy1u   tet1st
3    kumar       9  ert  nennwe     kumar       19  er1t  ne1nnwe

In [85]:
df1.join(df3,how='left')

      name  number test  string     name1  number1 test1  string1
0  ineuron       3  xyz   dffsd  ineuron1       31  xyz1   dffs1d
1     Sudh       4  abc    wqew     Sudh1       41  abc1    wq1ew
2    krish       6  dyu   tetst     krish        6  dy1u   tet1st
3    kumar       9  ert  nennwe     kumar       19  er1t  ne1nnwe

In [86]:
pwd()

'C:\\Users\\dinesh.kumar\\Desktop\\Python'

In [87]:
ls

 Volume in drive C is Windows
 Volume Serial Number is A894-DB8D

 Directory of C:\Users\dinesh.kumar\Desktop\Python

31-10-2021  21:15    <DIR>          .
31-10-2021  21:15    <DIR>          ..
31-10-2021  20:10    <DIR>          .ipynb_checkpoints
15-07-2021  07:27             1,173 addresses.csv
12-09-2021  20:09             1,654 Assignment_1.ipynb
08-09-2021  08:32             6,152 Class 1 .ipynb
24-10-2021  22:23            28,149 Class_12_MongoDB_Atlas.ipynb
30-10-2021  22:05             1,726 Class_13_MySqlConnection.ipynb
24-10-2021  22:23             2,115 Class11_Basic Installation .ipynb
31-10-2021  21:15            82,416 Class14_PamdaAdvance.ipynb
11-09-2021  22:12            42,757 Class3.ipynb
25-09-2021  19:52            17,932 Class4.ipynb
19-09-2021  23:30            33,575 Class5.ipynb
20-09-2021  07:36            41,433 Class6.ipynb
26-09-2021  22:07            33,729 Class7.ipynb
03-10-2021  22:23            26,073 Class8_Exception_Handling.ipynb
28-10-2021  08:16           189,278 Class9_Panda_Uses.ipynb
23-10-2021  19:08             1,589 contacts.csv
28-10-2021  07:46             1,589 contacts_Start.csv
05-09-2021  11:18             2,569 Demo1.ipynb
01-10-2021  09:20             4,960 Ineoron_Assignment1_Python_Basics_Conditional_Loops.ipynb
03-10-2021  11:36             2,343 Ineoron_Assignment2_String_Objects_And_List_Objects.ipynb
25-09-2021  19:57             2,679 Largest Number.ipynb
08-09-2021  08:59             3,196 P1_Syntax.ipynb
08-09-2021  09:05             3,583 P2_Comments.ipynb
11-09-2021  09:02            13,779 P3_Variables.ipynb
11-09-2021  09:52             4,541 P4-DataTypes.ipynb
28-10-2021  08:00            21,504 Sample.xls
03-10-2021  20:41                23 test.txt
              26 File(s)        570,517 bytes
               3 Dir(s)  34,096,680,960 bytes free

In [88]:
ls

 Volume in drive C is Windows
 Volume Serial Number is A894-DB8D

 Directory of C:\Users\dinesh.kumar\Desktop\Python

31-10-2021  21:17    <DIR>          .
31-10-2021  21:17    <DIR>          ..
31-10-2021  20:10    <DIR>          .ipynb_checkpoints
15-07-2021  07:27             1,173 addresses.csv
12-09-2021  20:09             1,654 Assignment_1.ipynb
08-09-2021  08:32             6,152 Class 1 .ipynb
24-10-2021  22:23            28,149 Class_12_MongoDB_Atlas.ipynb
30-10-2021  22:05             1,726 Class_13_MySqlConnection.ipynb
24-10-2021  22:23             2,115 Class11_Basic Installation .ipynb
31-10-2021  21:17            85,262 Class14_PamdaAdvance.ipynb
11-09-2021  22:12            42,757 Class3.ipynb
25-09-2021  19:52            17,932 Class4.ipynb
19-09-2021  23:30            33,575 Class5.ipynb
20-09-2021  07:36            41,433 Class6.ipynb
26-09-2021  22:07            33,729 Class7.ipynb
03-10-2021  22:23            26,073 Class8_Exception_Handling.ipynb
28-10-2021  08:16           189,278 Class9_Panda_Uses.ipynb
23-10-2021  19:08             1,589 contacts.csv
28-10-2021  07:46             1,589 contacts_Start.csv
05-09-2021  11:18             2,569 Demo1.ipynb
01-10-2021  09:20             4,960 Ineoron_Assignment1_Python_Basics_Conditional_Loops.ipynb
03-10-2021  11:36             2,343 Ineoron_Assignment2_String_Objects_And_List_Objects.ipynb
25-09-2021  19:57             2,679 Largest Number.ipynb
08-09-2021  08:59             3,196 P1_Syntax.ipynb
08-09-2021  09:05             3,583 P2_Comments.ipynb
11-09-2021  09:02            13,779 P3_Variables.ipynb
11-09-2021  09:52             4,541 P4-DataTypes.ipynb
28-10-2021  08:00            21,504 Sample.xls
03-10-2021  20:41                23 test.txt
              26 File(s)        573,363 bytes
               3 Dir(s)  34,096,553,984 bytes free

In [91]:
df1=pd.read_csv('contacts_start.csv')

In [92]:
df2=pd.read_csv('contacts.csv')

In [95]:
df5=pd.concat([df1,df2])

In [96]:
df5

,id*location_id*organization_id*service_id*name*title*email*department,id,location_id,organization_id,service_id,name,title,email,department
0,1*1***Susan Houston*Director of Older Adult Se...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2*1***Christina Gonzalez*Center Director**,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,"3*2***Brenda Brown*""Director* Second Career Se...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,"4*3***""Howard Lader* LCSW""*""Manager* Senior Pe...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,5*4***Kimberly Pesavento*Director of Visitation**,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...
26,NaN,27.0,19.0,NaN,NaN,Sharon Petersen,Administrator,NaN,NaN
27,NaN,28.0,21.0,NaN,NaN,Moncef,NaN,NaN,Office of Innovation
28,NaN,29.0,22.0,NaN,NaN,Suzanne Badenhoop,Board President,suzanne@example.com,Referrals
29,NaN,32.0,NaN,8.0,NaN,Elizabeth Feeney,CEO,e.feeney@foobar.org,Operations
30,NaN,36.0,NaN,NaN,22.0,Joe Smith,CalFresh Specialist,john.smith@example.org,CalFresh Applications

In [116]:
dict4={
    "col1":["aas","bdad3","c3312"],
    "col2":[1,2,3]
    
}

In [117]:
df5=pd.DataFrame(dict4)

In [99]:
df5

  col1  col2
0    a     1
1    b     2
2    c     3

In [119]:
#generate new column which will be twice of col2
df5['col3']=df5['col2']*2

In [101]:
df5

  col1  col2  col3
0    a     1     2
1    b     2     4
2    c     3     6

In [120]:
import numpy as np
df5['col4_log']=np.log(df5['col3'])

In [103]:
df5

  col1  col2  col3  col4_log
0    a     1     2  0.693147
1    b     2     4  1.386294
2    c     3     6  1.791759

In [121]:
def testfun(data):
    if data>500:
        return np.log10(data)
    else:
        return data/10

In [122]:
#apply function 
df5['col_fucn']=df5['col4_log'].apply(testfun)

In [112]:
df5

  col1  col2  col3  col4_log  col_fucn
0    a     1     2  0.693147  0.069315
1    b     2     4  1.386294  0.138629
2    c     3     6  1.791759  0.179176

In [123]:
#add colum to calculate lenght of col1
df5['col_lenght']=df5['col1'].apply(len)

In [124]:
df5

    col1  col2  col3  col4_log  col_fucn  col_lenght
0    aas     1     2  0.693147  0.069315           3
1  bdad3     2     4  1.386294  0.138629           5
2  c3312     3     6  1.791759  0.179176           5

In [125]:
#lamda function
#sorting operation

In [127]:
df5.sort_values(by='col3',ascending=True)

    col1  col2  col3  col4_log  col_fucn  col_lenght
0    aas     1     2  0.693147  0.069315           3
1  bdad3     2     4  1.386294  0.138629           5
2  c3312     3     6  1.791759  0.179176           5

In [128]:
df5.sort_values(by='col3',ascending=False)

    col1  col2  col3  col4_log  col_fucn  col_lenght
2  c3312     3     6  1.791759  0.179176           5
1  bdad3     2     4  1.386294  0.138629           5
0    aas     1     2  0.693147  0.069315           3

In [129]:
#map Operationn
l=[1,2,3,4,5,6]

In [130]:
#Add 1 in every element so 1 become 2, 2 become 3

In [132]:
[i+1for i in l]

[2, 3, 4, 5, 6, 7]

In [133]:
#achive via map
map

map

In [134]:
def test(data):
    return data+1

In [137]:
map(test,l)

In [138]:
list(map(test,l))

[2, 3, 4, 5, 6, 7]

In [139]:
#to perform list man where data is <3 squre and <3 log

In [146]:
def Calc(data):
    if data<3:
        return np.sqrt(data)
    else:
        return np.log(data)

In [142]:
map(Calc,l)

In [147]:
list(map(Calc,l))

[1.0,
 1.4142135623730951,
 1.0986122886681098,
 1.3862943611198906,
 1.6094379124341003,
 1.791759469228055]

In [148]:
#write fun inside map

In [149]:
l

[1, 2, 3, 4, 5, 6]

In [151]:
list(map(lambda data:data+1,l))

[2, 3, 4, 5, 6, 7]

In [152]:
#lambda is called ananymus method or without name

In [153]:
l1=[34,45,23,12,34,34]

In [154]:
l1

[34, 45, 23, 12, 34, 34]

In [155]:
#index wise operation for each list sum l1 index o with list 2 inddxe 
list(map(lambda x,y:x+y,l,l1))

[35, 47, 26, 16, 39, 40]

In [157]:
list(map(lambda 
         x: np.sqrt(x) 
         if x<3 else np.log(x)
         ,l))

[1.0,
 1.4142135623730951,
 1.0986122886681098,
 1.3862943611198906,
 1.6094379124341003,
 1.791759469228055]

In [169]:
#reduce operation
import functools as ft

In [162]:
#submition of each element 
l1=[4,5,6,7,7,8,8]

In [163]:
sum(l1)

45

In [167]:
functool.reduce(test1,l1)

NameError: name 'functool' is not defined

In [165]:
def test1(x,y):
    return x+y

In [170]:
ft.reduce(test1,l1)

45

In [171]:
#reduce takes only 2 pair ,
#try by lambda
ft.reduce(lambda x,y:x+y,l1)

45

In [173]:
#return max number in list 
ft.reduce(lambda x,y:x if x>y else y,l1)

8

In [174]:
#filter function
l=[1,2,3,4,5,6,7,8,9,9,0,0,0,45,47]

In [177]:
#get Even Numberm from list 
#1st way

In [180]:
def test3(data):
    if data%2 == 0:
        return True
    else :
        return False

In [181]:
list(filter(test3,l))

[2, 4, 6, 8, 0, 0, 0]

In [182]:
#try via lamda
list(filter(lambda x: True if x%2==0 else False,l))

[2, 4, 6, 8, 0, 0, 0]

In [183]:
#seprate lambda
lamb=lambda x: True if x%2==0 else False

In [184]:
list(filter(lamb,l))

[2, 4, 6, 8, 0, 0, 0]